<?php 
    /**
    *	Template name: Главная
    */
    get_header();
?>
<?php $first_block = get_field( 'first_block' );?>	
<?php if (is_array($first_block)) { ?>
    <div class="first_block">
        <div class="glide first_block__slider first_glide_js">
            <div class="glide__track" data-glide-el="track">
                <div class="glide__slides">
    				<?php foreach ($first_block as $e) { ?>
                        <div class="glide__slide" style="background: <?php echo $e['color']; ?> url(<?php echo $e['bg']; ?>) 100% 100% no-repeat;">
                            <div class="first_block__in center_block">
                                <div class="first_block__info">
                                    <h1 class="first_block__title"><?php echo $e['title']; ?></h1>
				                    <?php $items = ($e['items']); ?>
                                    <?php if (is_array($items)) { ?>
                                        <div class="first_block__items">
    				                        <?php foreach ($items as $s) { ?>
                                                <div class="first_block__item">
                                                    <div class="first_block__number"><?php echo $s['number']; ?></div>
                                                    <div class="first_block__txt"><?php echo $s['txt']; ?></div>
                                                </div>
    				                        <?php } ?>
                                        </div>
    				                <?php } ?>
				                    <?php $list = ($e['list']); ?>
                                    <?php if (is_array($list)) { ?>
                                        <ul class="first_block__list">
    				                        <?php foreach ($list as $l) { ?>
                                                <li><?php echo $l['text']; ?></li>
    				                        <?php } ?>
                                        </ul>
    				                <?php } ?>
                                    <div class="first_block__buttons">
                                        <a href="<?php echo $e['link1']; ?>" class="first_block__btn first_block__btn--big">Оставить заявку</a>
                                        <a href="<?php echo $e['link2']; ?>" class="first_block__btn first_block__btn--small">Подробнее</a>
                                    </div>
                                </div>
                            </div>
                        </div>
    				<?php } ?>
                </div>
            </div>
            <div class="glide__arrows">
                <div class="glide__arrows--items center_block" data-glide-el="controls">
                    <button class="glide__arrow glide__arrow--prev" data-glide-dir="<">Назад</button>
                    <div class="glide__counts">
                    <?php $count = count($first_block); ?>
                      <span class="glide__count"></span> <span class="glide__all">/ <?php echo $count; ?></span>
                    </div>
                    <button class="glide__arrow glide__arrow--next" data-glide-dir=">">Вперед</button>
                </div>
            </div>
        </div>
    </div>
<?php } ?> 
<?php $main_spec = get_field( 'main_spec' );?>	 	
<?php if ($main_spec['title']): ?>
    <div class="main_spec center_block">
        <div class="main_spec__top">
            <h1 class="main_spec__title"><?php echo $main_spec['title']; ?></h1>
            <a href="<?php echo $main_spec['link']; ?>" class="main_spec__more">Все предложения</a>
        </div>
        <div class="glide spec_glide_js">
            <div class="glide__track" data-glide-el="track">
                <div class="glide__slides main_spec__blocks">
					<?php $cpost = $main_spec['main_post'];?>
					<?php if( $cpost ): ?>
					<?php foreach( $cpost as $post): // Переменная должна быть названа обязательно $post (IMPORTANT) ?>
					<?php setup_postdata($post);
						$post_page = get_field('post_page');
						$img_url = $post_page['img']; 
						$text_mini = $post_page['text_mini'];?>
						<div class="main_spec__block glide__slide">
							<a href="<?php the_permalink(); ?>" class="main_spec__img">
								<picture><source srcset="<?php echo $img_url; ?>" type="image/webp"><img src="<?php echo $img_url; ?>" alt=""></picture>
								<div class="main_spec__date"><?php echo get_the_date('j F Y'); ?></div>
							</a>
							<div class="main_spec__info">
								<a href="<?php the_permalink(); ?>" class="main_spec__tit"><?php echo get_the_title(); ?></a>
								<div class="main_spec__text"><?php echo $text_mini; ?></div>
								<a href="<?php the_permalink(); ?>" class="main_spec__link">Подробнее</a>
							</div>
						</div>
					<?php endforeach; ?>
					<?php wp_reset_postdata(); // ВАЖНО - сбросьте значение $post object чтобы избежать ошибок в дальнейшем коде ?>
					<?php endif; ?>
                </div>
            </div>
            <div class="glide__arrows" data-glide-el="controls">
              <button class="glide__arrow glide__arrow--prev" data-glide-dir="<">Назад</button>
              <button class="glide__arrow glide__arrow--next" data-glide-dir=">">Вперед</button>
            </div>
            <div class="glide__bullets" data-glide-el="controls[nav]">
				<?php $cpost = $main_spec['main_post']; ?>
				<?php if ($cpost) : ?>
					<?php foreach ($cpost as $index => $post) : // Переменная должна быть названа обязательно $post (IMPORTANT) ?>
						<?php setup_postdata($post); ?>
						<button class="glide__bullet" data-glide-dir="=<?php echo $index; ?>"></button>
					<?php endforeach; ?>
					<?php wp_reset_postdata(); // ВАЖНО - сбросьте значение $post object чтобы избежать ошибок в дальнейшем коде ?>
				<?php endif; ?>
            </div>
        </div>
    </div>
<?php endif ?> 
<?php $main_services = get_field( 'main_services' );?>	 	
<?php if (is_array($main_services)) { ?>
    <div class="main_services center_block">
        <div class="main_services__blocks">
			<?php foreach ($main_services as $e) { ?>
                <div class="main_services__block" style="background: <?php echo $e['bg_color']; ?>;">
                    <div class="main_services__img">
                        <img class="main_services__img--pc" src="<?php echo $e['img_pc']; ?>" alt="">
                    </div>
                    <div class="main_services__info">
                        <?php if ($e['flag']): ?>
                            <div class="main_services__flag"><?php echo $e['flag']; ?></div>
                        <?php endif ?> 
                        <div class="main_services__title" style="color: <?php echo $e['color']; ?>;"><?php echo $e['title']; ?></div>
                        <?php if ($e['text']): ?>
                            <div class="main_services__text" style="color: <?php echo $e['color']; ?>"><?php echo $e['text']; ?></div>
                        <?php endif ?> 
	                    <?php $prices = ($e['prices']); ?>
                        <?php if (is_array($prices)) { ?>
                            <div class="main_services__prices">
		                        <?php foreach ($prices as $d) { ?>
                                    <div class="main_services__price" style="color: <?php echo $d['color']; ?>"><?php echo $d['price']; ?></div>
		                        <?php } ?>
                            </div>
		                <?php } ?>
	                    <?php $slist = ($e['list']); ?>
                        <?php if (is_array($slist)) { ?>
                            <ul class="main_services__list">
		                        <?php foreach ($slist as $l) { ?>
                                    <li><?php echo $l['text']; ?></li>
		                        <?php } ?>
                            </ul>
		                <?php } ?>
	                    <?php $slist2 = ($e['list2']); ?>
                        <?php if (is_array($slist2)) { ?>
                            <ul class="main_services__list2">
		                        <?php foreach ($slist2 as $r) { ?>
                                    <li><?php echo $r['text']; ?></li>
		                        <?php } ?>
                            </ul>
		                <?php } ?>
	                    <?php $slist3 = ($e['list3']); ?>
                        <?php if (is_array($slist3)) { ?>
                            <ul class="main_services__list3">
		                        <?php foreach ($slist3 as $s) { ?>
                                    <li><?php echo $s['text']; ?></li>
		                        <?php } ?>
                            </ul>
		                <?php } ?>
                        <a href="<?php echo $e['link']; ?>" class="main_services__more" style="color: <?php echo $e['color']; ?>; border-color: <?php echo $e['color']; ?>;">Подробнее</a>
                    </div>
                </div>
			<?php } ?>
        </div>
    </div>
<?php } ?> 
<?php $main_about = get_field( 'main_about' );?>	 	
<?php if ($main_about['title']): ?>
    <div class="main_about">
        <div class="main_about__blocks center_block">
            <div class="main_about__l-side">
                <div class="main_about__title"><?php echo $main_about['title']; ?></div>
                <?php $items = ($main_about['items']); ?>
                <?php if (is_array($items)) { ?>
                    <div class="main_about__items">
                        <?php foreach ($items as $e) { ?>
                            <div class="main_about__item">
                                <div class="main_about__number"><?php echo $e['number']; ?></div>
                                <div class="main_about__text"><?php echo $e['text']; ?></div>
                            </div>
                        <?php } ?>
                    </div>
                <?php } ?> 	
                <?php if ($main_about['text']): ?>
                    <div class="main_about__txt"><?php echo $main_about['text']; ?></div>
                <?php endif ?> 
                <a href="<?php echo $main_about['link']; ?>" class="main_about__btn">Подробнее о кооперативе</a>
            </div>
            <div class="main_about__r-side">
                <div class="main_about__img">
                    <img class="main_about__img--pc" src="<?php echo $main_about['img1']; ?>" alt="">
                    <img class="main_about__img--mob" src="<?php echo $main_about['img2']; ?>" alt="">
                </div>
                <?php if ($main_about['names']): ?>
                    <div class="main_about__info">
                        <div class="main_about__logo">
                            <svg width="68" height="70" viewBox="0 0 68 70" fill="none" xmlns="http://www.w3.org/2000/svg">
                                <path d="M67.3368 65.4743L45.2785 36L40.5855 42.7822C38.4569 45.6251 34.3614 46.7086 31.573 46.7596L12.1288 47.2314H11.4441H11.2822C8.78714 47.4103 6.42406 48.4469 4.57593 50.1729C2.7278 51.899 1.50287 54.2136 1.09959 56.7416C1.09959 56.9711 1.02489 57.1878 1 57.4046V57.5066C1 57.6978 1 57.8763 1 58.0675V58.6029V59.4698C1.02717 60.2091 1.12726 60.9438 1.29876 61.6625V61.8027V61.9302C1.938 64.1691 3.24351 66.1478 5.03324 67.5906C5.16602 67.6746 5.30315 67.7512 5.44403 67.82C7.30191 69.2043 9.53263 69.9659 11.83 70H65.482C65.9693 69.9925 66.4437 69.8387 66.8465 69.5577C67.2491 69.2767 67.5625 68.8808 67.7476 68.4192C67.9679 67.941 68.0465 67.4071 67.9735 66.8836C67.9004 66.3602 67.6791 65.8702 67.3368 65.4743Z" fill="#13B8D9"/>
                                <path d="M0 52C0.904269 50.1613 2.21456 48.5571 3.82974 47.3113C5.44492 46.0654 7.32183 45.2112 9.31552 44.8146C9.602 44.7516 9.88841 44.7014 10.1873 44.6636C10.9355 44.5296 11.694 44.4622 12.4539 44.4623H13.1762L31.5084 44.0595C33.9992 44.0595 37.1874 43.0654 38.6943 41.0897L44.336 33.036L44.4978 32.8095L44.6224 32.6334L45.1953 31.828L65.4951 4.34471C65.7884 3.92943 65.9612 3.43976 65.9942 2.9307C66.0272 2.42164 65.9191 1.91338 65.6819 1.463C65.474 1.03591 65.1536 0.674945 64.7559 0.419675C64.3583 0.164407 63.8988 0.0246902 63.4278 0.0158442H4.89439C3.71554 -0.0833173 2.54487 0.285762 1.631 1.0447C0.717125 1.80363 0.13204 2.89264 0 4.08045C0 6.39589 0 7.75496 0 7.76751V52Z" fill="#224875"/>
                            </svg>
                        </div>
                        <div class="main_about__txts">
                            <div class="main_about__name"><?php echo $main_about['names']; ?></div>
                            <div class="main_about__work"><?php echo $main_about['work']; ?></div>
                        </div>
                    </div>
                <?php endif ?> 
            </div>
        </div>
    </div>
<?php endif ?> 
<?php $main_texts = get_field( 'main_texts' );?>	 	
<?php if (is_array($main_texts)) { ?>
    <div class="main_texts center_block">
        <div class="main_texts__blocks">
            <?php foreach ($main_texts as $e) { ?>
                <div class="main_texts__block">
                    <div class="main_texts__title"><?php echo $e['title']; ?></div>
                    <div class="main_texts__text"><?php echo $e['text']; ?></div>
                </div>
            <?php } ?>
        </div>
    </div>
<?php } ?> 
<?php $main_news = get_field( 'main_news' );?>	 	
<?php if ($main_news['title']): ?>
    <div class="main_news">
        <div class="main_news__in center_block">
            <div class="main_news__top">
                <div class="main_news__title"><?php echo $main_news['title']; ?></div>
                <a href="<?php echo $main_news['link']; ?>" class="main_news__more">Все новости</a>
            </div>
            <div class="glide news_glide_js">
                <div class="glide__track" data-glide-el="track">
                    <div class="glide__slides main_news__blocks">
						<?php
						$args = array(
							'post_type' => 'post',
							'posts_per_page' => 5,
							'order' => 'DESC',
						);
						$query = new WP_Query($args);
						while ($query->have_posts()) {
							$query->the_post(); ?>
							<a href="<?php the_permalink(); ?>" class="main_news__block glide__slide">
								<div class="main_news__img">
									<picture><source srcset="<?php echo get_the_post_thumbnail_url(); ?>" type="image/webp"><img src="<?php echo get_the_post_thumbnail_url(); ?>" alt=""></picture>
								</div>
								<div class="main_news__info">
									<div class="main_news__date"><?php echo get_the_date('j F Y'); ?></div>
									<div class="main_news__tit"><?php the_title(); ?></div>
								</div>
							</a>
						<?php
						}
						wp_reset_postdata();
						?>
                    </div>
                </div>
                <div class="glide__arrows" data-glide-el="controls">
                  <button class="glide__arrow glide__arrow--prev" data-glide-dir="<">Назад</button>
                  <button class="glide__arrow glide__arrow--next" data-glide-dir=">">Вперед</button>
                </div>
                <div class="glide__bullets" data-glide-el="controls[nav]">
					<?php
						$post_count = $query->post_count;
						for ($i = 0; $i < $post_count; $i++) {
							echo '<button class="glide__bullet" data-glide-dir="=' . $i . '"></button>';
						}
					?>
                </div>
            </div>
        </div>
    </div>
<?php endif ?> 
<?php $main_post = get_field( 'main_post' );?>	 	
<?php if ($main_post['title']): ?>
    <div class="main_post center_block">
        <div class="main_post__top">
            <h1 class="main_post__title"><?php echo $main_post['title']; ?></h1>
            <a href="<?php echo $main_post['link']; ?>" class="main_post__more">Все статьи</a>
        </div>
		<?php $spost = $main_post['main_post'];?>
        <div class="main_post__blocks js_main_post">
			 <?php if( $spost ): ?>
			<?php foreach( $spost as $post): // Переменная должна быть названа обязательно $post (IMPORTANT) ?>
				<?php setup_postdata($post);
				$post_page = get_field('post_page');
				$img_url = $post_page['img']; ?>
					<a href="<?php the_permalink(); ?>" class="main_post__block">
						<div class="main_post__img">
							<picture><source srcset="<?php echo $img_url; ?>" type="image/webp"><img src="<?php echo $img_url; ?>" alt=""></picture>
						</div>
						<div class="main_post__info">
							<div class="main_post__date"><?php echo get_the_date('j F Y'); ?></div>
							<div class="main_post__tit"><?php echo get_the_title(); ?></div>
						</div>
					</a>
				<?php endforeach; ?>
			<?php wp_reset_postdata(); // ВАЖНО - сбросьте значение $post object чтобы избежать ошибок в дальнейшем коде ?>
			<?php endif; ?>
        </div>
    </div>
<?php endif ?> 
<?php $main_map = get_field( 'main_map' );?>	 	
<?php if ($main_map['title']): ?>
	<div class="main_map">
		<div class="main_map__l-side" id="office">
			<div class="main_map__title"><?php echo $main_map['title']; ?></div>
			<div class="main_map__menu">
                <ul class="submenu">
                    <?php $marks = $main_map['marks'];?>
                    <?php foreach ($marks as $index => $mark): ?>
                        <li>
                            <span><?php echo $index + 1 < 10 ? '0' . ($index + 1) : $index + 1; ?></span>
                            <a href="#" class="map-link" data-coords="<?php echo $mark['coords'] ?>"><?php echo $mark['content']; ?></a>
                        </li>
                    <?php endforeach; ?>
					<div class="main_map__trigger"></div>
                </ul>
			</div>
			<div class="main_map__info">
				<div class="main_map__info--l-side">
					<div class="main_map__info--tel">
						<span>Телефон:</span>
						<?php
							$site_telephone = get_option('site_telephone');
							if (!empty($site_telephone)) {
								echo '<a href="tel:' . esc_attr($site_telephone) . '">' . esc_html($site_telephone) . '</a>';
							}
						?>
					</div>
					<div class="main_map__info--tel">
						<span>Почта</span>
						<?php
							$site_email = get_option('site_email');
							if (!empty($site_email)) {
								echo '<a href="mailto:' . esc_html($site_email) . '">' . esc_html($site_email) . '</a>';
							}
						?>
					</div>
				</div>
				<div class="main_map__info--r-side">
					<div class="main_map__info--tel">
						<span>Мессенджеры</span>
						<div>Напишите нам, <br>
							мы онлайн</div>
						<div class="main_map__info--socs">
							<?php $site_tg = get_option('site_tg');
							if (!empty($site_tg)) { ?>
								<a href="<?php echo $site_tg; ?>" target="_blank" rel="noopener noreferrer">
									<svg width="27" height="22" viewBox="0 0 27 22" fill="none" xmlns="http://www.w3.org/2000/svg">
										<path d="M6.63828 12.8235L0.540637 10.861C0.540637 10.861 -0.188099 10.569 0.046554 9.90673C0.0948588 9.77017 0.192301 9.65396 0.483795 9.45426C1.83487 8.52403 25.4911 0.125203 25.4911 0.125203C25.4911 0.125203 26.159 -0.0971229 26.553 0.0507517C26.6504 0.0805501 26.7381 0.135385 26.8071 0.209645C26.876 0.283905 26.9238 0.374926 26.9455 0.473398C26.988 0.647323 27.0058 0.826263 26.9983 1.00505C26.9965 1.15971 26.9775 1.30306 26.9631 1.52785C26.8191 3.82412 22.5075 20.9619 22.5075 20.9619C22.5075 20.9619 22.2495 21.9648 21.3252 21.9991C21.0981 22.0064 20.8718 21.9684 20.6599 21.8874C20.4479 21.8064 20.2547 21.6841 20.0916 21.5277C18.2779 19.9867 12.0091 15.8252 10.6238 14.91C10.5926 14.889 10.5663 14.8616 10.5467 14.8296C10.5271 14.7977 10.5146 14.762 10.5102 14.7249C10.4908 14.6284 10.597 14.5089 10.597 14.5089C10.597 14.5089 21.5126 4.92485 21.8031 3.91873C21.8256 3.84078 21.7406 3.80233 21.6265 3.83647C20.9015 4.09993 8.33353 11.9397 6.94644 12.805C6.84659 12.8348 6.74106 12.8412 6.63828 12.8235Z" fill="#224875"/>
									</svg>
								</a>
							<?php } ?>
							<?php $site_vk = get_option('site_vk');
							if (!empty($site_vk)) { ?>
								<a href="<?php echo $site_vk; ?>" target="_blank" rel="noopener noreferrer">
									<svg width="24" height="14" viewBox="0 0 24 14" fill="none" xmlns="http://www.w3.org/2000/svg">
										<path d="M23.7771 12.5616C23.7771 12.4658 23.6816 12.4658 23.6816 12.3699C23.2996 11.6027 22.4402 10.6438 21.2943 9.58905C20.7214 9.10959 20.4349 8.72603 20.2439 8.53425C19.9575 8.15068 19.9575 7.86302 20.053 7.47946C20.1485 7.19179 20.5304 6.71232 21.1988 5.84931C21.5808 5.36986 21.7718 5.08219 22.0582 4.79452C23.4906 2.87671 24.159 1.63013 23.968 1.05479L23.8726 0.958905C23.7771 0.863014 23.6816 0.767127 23.4906 0.767127C23.2996 0.671236 23.0131 0.671236 22.7267 0.767127H19.0981C19.0026 0.767127 19.0026 0.767127 18.8116 0.767127C18.7161 0.767127 18.6206 0.767127 18.6206 0.767127H18.5251H18.4296L18.3341 0.863008C18.2386 0.958899 18.2386 0.958896 18.2386 1.05479C17.8567 2.10958 17.3792 2.9726 16.9018 3.9315C16.6153 4.41095 16.3288 4.89041 16.0424 5.27398C15.7559 5.65754 15.5649 5.9452 15.3739 6.13698C15.1829 6.32876 14.992 6.42466 14.8965 6.61644C14.801 6.71233 14.61 6.80822 14.61 6.71233C14.5145 6.71233 14.419 6.71233 14.419 6.61644C14.3235 6.52055 14.228 6.42465 14.1326 6.32876C14.0371 6.23287 14.0371 6.04109 13.9416 5.84931C13.9416 5.65753 13.9416 5.46575 13.9416 5.36986C13.9416 5.27397 13.9416 4.9863 13.9416 4.79452C13.9416 4.50685 13.9416 4.31507 13.9416 4.21917C13.9416 3.9315 13.9416 3.54795 13.9416 3.16439C13.9416 2.78083 13.9416 2.49315 13.9416 2.30137C13.9416 2.10958 13.9416 1.82192 13.9416 1.63014C13.9416 1.34246 13.9416 1.15068 13.9416 1.05479C13.9416 0.958896 13.8461 0.767121 13.8461 0.67123C13.7506 0.57534 13.6551 0.479447 13.5596 0.383556C13.4641 0.287666 13.2731 0.287668 13.1777 0.191778C12.7002 0.0958875 12.1273 0 11.4588 0C9.931 0 8.8806 0.0958934 8.49864 0.287674C8.30766 0.383565 8.11668 0.479449 8.02119 0.67123C7.83021 0.863011 7.8302 0.958905 7.92569 0.958905C8.40314 1.0548 8.78511 1.24657 8.97609 1.53424L9.07159 1.72603C9.16708 1.82192 9.16706 2.01369 9.26255 2.30137C9.35804 2.58904 9.35804 2.87671 9.35804 3.26027C9.35804 3.83561 9.35804 4.41096 9.35804 4.79452C9.35804 5.27398 9.26255 5.56164 9.26255 5.84931C9.26255 6.13698 9.16708 6.32877 9.07159 6.42466C8.9761 6.61644 8.97608 6.71233 8.88059 6.71233C8.88059 6.71233 8.88059 6.80821 8.7851 6.80821C8.68961 6.80821 8.59412 6.90411 8.40314 6.90411C8.30765 6.90411 8.11668 6.80822 8.02119 6.71233C7.83021 6.61644 7.63923 6.42466 7.54374 6.23288C7.35276 6.0411 7.16177 5.75342 6.97079 5.36986C6.77981 4.9863 6.49333 4.60274 6.30235 4.0274L6.11138 3.64384C6.01589 3.45206 5.82491 3.06849 5.63393 2.58904C5.44295 2.10959 5.25197 1.72603 5.06098 1.24658C4.96549 1.0548 4.87002 0.958899 4.77453 0.863008H4.67903C4.67903 0.863008 4.58353 0.767127 4.48804 0.767127C4.39255 0.767127 4.29707 0.67123 4.20158 0.67123H0.763925C0.381964 0.67123 0.190986 0.767118 0.0954961 0.863008L0 0.958905C0 0.958905 0 1.05479 0 1.15068C0 1.24657 5.82684e-06 1.34246 0.0954961 1.53424C0.572947 2.68492 1.14589 3.83562 1.71883 4.9863C2.29177 6.0411 2.86472 7 3.24668 7.67124C3.72413 8.34247 4.10608 9.0137 4.58353 9.58905C5.06098 10.1644 5.34745 10.5479 5.44294 10.7397C5.63392 10.9315 5.7294 11.0274 5.82489 11.1233L6.11138 11.411C6.30236 11.6027 6.58883 11.8904 6.97079 12.1781C7.35275 12.4658 7.8302 12.7534 8.30765 13.0411C8.7851 13.3288 9.35805 13.5206 9.93099 13.7123C10.5994 13.9041 11.1724 14 11.7453 13.9041H13.1777C13.4641 13.9041 13.6551 13.8082 13.8461 13.6164L13.9416 13.5205C13.9416 13.4247 14.0371 13.4247 14.0371 13.3288C14.0371 13.2329 14.0371 13.137 14.0371 12.9452C14.0371 12.5617 14.0371 12.274 14.1326 11.9863C14.228 11.6986 14.2281 11.5069 14.3235 11.3151C14.419 11.1233 14.5145 11.0274 14.61 10.9315C14.7055 10.8356 14.801 10.7397 14.801 10.7397H14.8965C15.0874 10.6438 15.3739 10.7397 15.5649 10.9315C15.8514 11.1233 16.1378 11.411 16.3288 11.6986C16.5198 11.9863 16.8063 12.274 17.1883 12.6575C17.5702 13.0411 17.8567 13.3288 18.0477 13.4247L18.3341 13.6164C18.5251 13.7123 18.7161 13.8082 19.0026 13.9041C19.289 14 19.48 14 19.671 14L22.9177 13.9041C23.2041 13.9041 23.4906 13.8082 23.6816 13.7123C23.8726 13.6164 23.968 13.5205 23.968 13.3288C23.968 13.2329 23.968 13.0411 23.968 12.9452C23.7771 12.7534 23.7771 12.6575 23.7771 12.5616Z" fill="#224875"/>
									</svg>
								</a>
							<?php } ?>
							<?php $site_insta = get_option('site_insta');
							if (!empty($site_insta)) { ?>
								<a href="<?php echo $site_insta; ?>" target="_blank" rel="noopener noreferrer">
									<svg width="21" height="21" viewBox="0 0 21 21" fill="none" xmlns="http://www.w3.org/2000/svg">
										<path d="M18.0115 0H2.98846C1.29231 0 0 1.29231 0 2.98846V18.0115C0 19.7077 1.29231 21 2.98846 21H18.0115C19.7077 21 21 19.7077 21 18.0115V2.98846C21 1.29231 19.7077 0 18.0115 0ZM10.5 16.8C13.9731 16.8 16.8 14.0538 16.8 10.7423C16.8 10.1769 16.7192 9.53077 16.5577 9.04615H18.3346V17.6077C18.3346 18.0115 18.0115 18.4154 17.5269 18.4154H3.47308C3.06923 18.4154 2.66539 18.0923 2.66539 17.6077V8.96538H4.52308C4.36154 9.53077 4.28077 10.0962 4.28077 10.6615C4.2 14.0538 7.02692 16.8 10.5 16.8ZM10.5 14.3769C8.23846 14.3769 6.46154 12.6 6.46154 10.4192C6.46154 8.23846 8.23846 6.46154 10.5 6.46154C12.7615 6.46154 14.5385 8.23846 14.5385 10.4192C14.5385 12.6808 12.7615 14.3769 10.5 14.3769ZM18.2539 5.73461C18.2539 6.21923 17.85 6.62308 17.3654 6.62308H15.1038C14.6192 6.62308 14.2154 6.21923 14.2154 5.73461V3.55385C14.2154 3.06923 14.6192 2.66538 15.1038 2.66538H17.3654C17.85 2.66538 18.2539 3.06923 18.2539 3.55385V5.73461Z" fill="#224875"/>
									</svg>
								</a>
							<?php } ?>
							<?php $site_ok = get_option('site_ok');
							if (!empty($site_ok)) { ?>
								<a href="<?php echo $site_ok; ?>" target="_blank" rel="noopener noreferrer">
									<svg width="16" height="26" viewBox="0 0 16 26" fill="none" xmlns="http://www.w3.org/2000/svg">
										<path d="M15.4794 16C16.0929 15.3913 16.1806 14.5217 15.6547 13.6522C15.2164 12.9565 14.4275 12.6087 13.5509 12.7826C13.2003 12.8696 12.8497 13.0435 12.4991 13.3044C9.78176 15.1304 6.10025 15.0435 3.38294 13.2174C3.20763 13.1304 3.03231 13.0435 2.857 12.9565C1.8928 12.5217 0.928601 12.6957 0.40267 13.5652C-0.210916 14.4348 -0.123271 15.3913 0.665625 16.1739C0.840935 16.3478 1.01625 16.4348 1.1039 16.6087L1.19156 16.6957C2.41873 17.6522 3.90887 18.2609 5.83729 18.5217L4.69777 19.6522C3.73356 20.6087 2.6817 21.6522 1.7175 22.6087C1.45453 22.8696 1.1039 23.3044 1.1039 23.913C1.1039 24.6957 1.54218 25.4783 2.33108 25.8261C2.59405 26 2.85701 26 3.11997 26C3.55825 26 4.08418 25.8261 4.4348 25.3913C5.74963 24.087 6.8015 23.0435 7.85336 22C7.94101 21.9131 7.94101 21.913 7.94101 21.913C7.94101 21.913 8.02867 21.9131 8.02867 22C8.72991 22.7826 9.5188 23.4783 10.22 24.2609C10.5707 24.6087 10.9213 24.9565 11.2719 25.3044C11.7102 25.7391 12.0608 25.9131 12.5867 25.9131C13.3756 26 14.2522 25.4783 14.6028 24.6957C14.9534 24 14.7781 23.1304 14.1645 22.6087C13.288 21.7391 12.4114 20.7826 11.4472 19.913L9.95708 18.4348C10.746 18.3478 11.6225 18.1739 12.4114 17.8261C13.7263 17.3913 14.6905 16.7826 15.4794 16Z" fill="#224875"/>
										<path d="M7.94101 13.5652C11.7102 13.5652 14.7781 10.6087 14.7781 6.86956C14.7781 5.04347 14.0769 3.30435 12.762 2C11.4472 0.695655 9.78177 0 8.02867 0C4.25949 0 1.27922 3.04347 1.19156 6.69565C1.19156 8.52173 1.8928 10.1739 3.20763 11.4783C4.4348 12.8696 6.10025 13.5652 7.94101 13.5652ZM6.01259 4.86957C6.53853 4.34783 7.23976 4.08695 7.94101 4.08695C9.5188 4.08695 10.6583 5.30435 10.6583 6.78261C10.6583 8.34783 9.43114 9.47825 7.94101 9.47825C6.36321 9.47825 5.2237 8.26087 5.2237 6.78261C5.2237 6.08696 5.48666 5.39131 6.01259 4.86957Z" fill="#224875"/>
										<path d="M15.4794 16C16.0929 15.3913 16.1806 14.5217 15.6547 13.6522C15.2164 12.9565 14.4275 12.6087 13.5509 12.7826C13.2003 12.8696 12.8497 13.0435 12.4991 13.3044C9.78176 15.1304 6.10025 15.0435 3.38294 13.2174C3.20763 13.1304 3.03231 13.0435 2.857 12.9565C1.8928 12.5217 0.928601 12.6957 0.40267 13.5652C-0.210916 14.4348 -0.123271 15.3913 0.665625 16.1739C0.840935 16.3478 1.01625 16.4348 1.1039 16.6087L1.19156 16.6957C2.41873 17.6522 3.90887 18.2609 5.83729 18.5217L4.69777 19.6522C3.73356 20.6087 2.6817 21.6522 1.7175 22.6087C1.45453 22.8696 1.1039 23.3044 1.1039 23.913C1.1039 24.6957 1.54218 25.4783 2.33108 25.8261C2.59405 26 2.85701 26 3.11997 26C3.55825 26 4.08418 25.8261 4.4348 25.3913C5.74963 24.087 6.8015 23.0435 7.85336 22C7.94101 21.9131 7.94101 21.913 7.94101 21.913C7.94101 21.913 8.02867 21.9131 8.02867 22C8.72991 22.7826 9.5188 23.4783 10.22 24.2609C10.5707 24.6087 10.9213 24.9565 11.2719 25.3044C11.7102 25.7391 12.0608 25.9131 12.5867 25.9131C13.3756 26 14.2522 25.4783 14.6028 24.6957C14.9534 24 14.7781 23.1304 14.1645 22.6087C13.288 21.7391 12.4114 20.7826 11.4472 19.913L9.95708 18.4348C10.746 18.3478 11.6225 18.1739 12.4114 17.8261C13.7263 17.3913 14.6905 16.7826 15.4794 16Z" fill="#224875"/>
									</svg>                        
								</a>
							<?php } ?>
						</div>
					</div>
				</div>
			</div>
		</div>
		<div class="main_map__r-side">
            <div class="map-block" id="map" style="width: 100%; height: 100%;"></div>
		</div>
		<div class="main_map__info mob">
			<div class="main_map__info--l-side">
				<div class="main_map__info--tel">
					<span>Телефон:</span>
					<?php
					$site_telephone = get_option('site_telephone');
					if (!empty($site_telephone)) {
						echo '<a href="tel:' . esc_attr($site_telephone) . '">' . esc_html($site_telephone) . '</a>';
					}
					?>
				</div>
				<div class="main_map__info--tel">
					<span>Почта</span>
					<?php
					$site_email = get_option('site_email');
					if (!empty($site_email)) {
						echo '<a href="mailto:' . esc_html($site_email) . '">' . esc_html($site_email) . '</a>';
					}
					?>
				</div>
			</div>
			<div class="main_map__info--r-side">
				<div class="main_map__info--tel">
					<span>Мессенджеры</span>
					<div>Напишите нам, <br>
						мы онлайн</div>
					<div class="main_map__info--socs">
						<?php $site_tg = get_option('site_tg');
						if (!empty($site_tg)) { ?>
						<a href="<?php echo $site_tg; ?>" target="_blank" rel="noopener noreferrer">
							<svg width="27" height="22" viewBox="0 0 27 22" fill="none" xmlns="http://www.w3.org/2000/svg">
								<path d="M6.63828 12.8235L0.540637 10.861C0.540637 10.861 -0.188099 10.569 0.046554 9.90673C0.0948588 9.77017 0.192301 9.65396 0.483795 9.45426C1.83487 8.52403 25.4911 0.125203 25.4911 0.125203C25.4911 0.125203 26.159 -0.0971229 26.553 0.0507517C26.6504 0.0805501 26.7381 0.135385 26.8071 0.209645C26.876 0.283905 26.9238 0.374926 26.9455 0.473398C26.988 0.647323 27.0058 0.826263 26.9983 1.00505C26.9965 1.15971 26.9775 1.30306 26.9631 1.52785C26.8191 3.82412 22.5075 20.9619 22.5075 20.9619C22.5075 20.9619 22.2495 21.9648 21.3252 21.9991C21.0981 22.0064 20.8718 21.9684 20.6599 21.8874C20.4479 21.8064 20.2547 21.6841 20.0916 21.5277C18.2779 19.9867 12.0091 15.8252 10.6238 14.91C10.5926 14.889 10.5663 14.8616 10.5467 14.8296C10.5271 14.7977 10.5146 14.762 10.5102 14.7249C10.4908 14.6284 10.597 14.5089 10.597 14.5089C10.597 14.5089 21.5126 4.92485 21.8031 3.91873C21.8256 3.84078 21.7406 3.80233 21.6265 3.83647C20.9015 4.09993 8.33353 11.9397 6.94644 12.805C6.84659 12.8348 6.74106 12.8412 6.63828 12.8235Z" fill="#224875"/>
							</svg>
						</a>
						<?php } ?>
						<?php $site_vk = get_option('site_vk');
						if (!empty($site_vk)) { ?>
						<a href="<?php echo $site_vk; ?>" target="_blank" rel="noopener noreferrer">
							<svg width="24" height="14" viewBox="0 0 24 14" fill="none" xmlns="http://www.w3.org/2000/svg">
								<path d="M23.7771 12.5616C23.7771 12.4658 23.6816 12.4658 23.6816 12.3699C23.2996 11.6027 22.4402 10.6438 21.2943 9.58905C20.7214 9.10959 20.4349 8.72603 20.2439 8.53425C19.9575 8.15068 19.9575 7.86302 20.053 7.47946C20.1485 7.19179 20.5304 6.71232 21.1988 5.84931C21.5808 5.36986 21.7718 5.08219 22.0582 4.79452C23.4906 2.87671 24.159 1.63013 23.968 1.05479L23.8726 0.958905C23.7771 0.863014 23.6816 0.767127 23.4906 0.767127C23.2996 0.671236 23.0131 0.671236 22.7267 0.767127H19.0981C19.0026 0.767127 19.0026 0.767127 18.8116 0.767127C18.7161 0.767127 18.6206 0.767127 18.6206 0.767127H18.5251H18.4296L18.3341 0.863008C18.2386 0.958899 18.2386 0.958896 18.2386 1.05479C17.8567 2.10958 17.3792 2.9726 16.9018 3.9315C16.6153 4.41095 16.3288 4.89041 16.0424 5.27398C15.7559 5.65754 15.5649 5.9452 15.3739 6.13698C15.1829 6.32876 14.992 6.42466 14.8965 6.61644C14.801 6.71233 14.61 6.80822 14.61 6.71233C14.5145 6.71233 14.419 6.71233 14.419 6.61644C14.3235 6.52055 14.228 6.42465 14.1326 6.32876C14.0371 6.23287 14.0371 6.04109 13.9416 5.84931C13.9416 5.65753 13.9416 5.46575 13.9416 5.36986C13.9416 5.27397 13.9416 4.9863 13.9416 4.79452C13.9416 4.50685 13.9416 4.31507 13.9416 4.21917C13.9416 3.9315 13.9416 3.54795 13.9416 3.16439C13.9416 2.78083 13.9416 2.49315 13.9416 2.30137C13.9416 2.10958 13.9416 1.82192 13.9416 1.63014C13.9416 1.34246 13.9416 1.15068 13.9416 1.05479C13.9416 0.958896 13.8461 0.767121 13.8461 0.67123C13.7506 0.57534 13.6551 0.479447 13.5596 0.383556C13.4641 0.287666 13.2731 0.287668 13.1777 0.191778C12.7002 0.0958875 12.1273 0 11.4588 0C9.931 0 8.8806 0.0958934 8.49864 0.287674C8.30766 0.383565 8.11668 0.479449 8.02119 0.67123C7.83021 0.863011 7.8302 0.958905 7.92569 0.958905C8.40314 1.0548 8.78511 1.24657 8.97609 1.53424L9.07159 1.72603C9.16708 1.82192 9.16706 2.01369 9.26255 2.30137C9.35804 2.58904 9.35804 2.87671 9.35804 3.26027C9.35804 3.83561 9.35804 4.41096 9.35804 4.79452C9.35804 5.27398 9.26255 5.56164 9.26255 5.84931C9.26255 6.13698 9.16708 6.32877 9.07159 6.42466C8.9761 6.61644 8.97608 6.71233 8.88059 6.71233C8.88059 6.71233 8.88059 6.80821 8.7851 6.80821C8.68961 6.80821 8.59412 6.90411 8.40314 6.90411C8.30765 6.90411 8.11668 6.80822 8.02119 6.71233C7.83021 6.61644 7.63923 6.42466 7.54374 6.23288C7.35276 6.0411 7.16177 5.75342 6.97079 5.36986C6.77981 4.9863 6.49333 4.60274 6.30235 4.0274L6.11138 3.64384C6.01589 3.45206 5.82491 3.06849 5.63393 2.58904C5.44295 2.10959 5.25197 1.72603 5.06098 1.24658C4.96549 1.0548 4.87002 0.958899 4.77453 0.863008H4.67903C4.67903 0.863008 4.58353 0.767127 4.48804 0.767127C4.39255 0.767127 4.29707 0.67123 4.20158 0.67123H0.763925C0.381964 0.67123 0.190986 0.767118 0.0954961 0.863008L0 0.958905C0 0.958905 0 1.05479 0 1.15068C0 1.24657 5.82684e-06 1.34246 0.0954961 1.53424C0.572947 2.68492 1.14589 3.83562 1.71883 4.9863C2.29177 6.0411 2.86472 7 3.24668 7.67124C3.72413 8.34247 4.10608 9.0137 4.58353 9.58905C5.06098 10.1644 5.34745 10.5479 5.44294 10.7397C5.63392 10.9315 5.7294 11.0274 5.82489 11.1233L6.11138 11.411C6.30236 11.6027 6.58883 11.8904 6.97079 12.1781C7.35275 12.4658 7.8302 12.7534 8.30765 13.0411C8.7851 13.3288 9.35805 13.5206 9.93099 13.7123C10.5994 13.9041 11.1724 14 11.7453 13.9041H13.1777C13.4641 13.9041 13.6551 13.8082 13.8461 13.6164L13.9416 13.5205C13.9416 13.4247 14.0371 13.4247 14.0371 13.3288C14.0371 13.2329 14.0371 13.137 14.0371 12.9452C14.0371 12.5617 14.0371 12.274 14.1326 11.9863C14.228 11.6986 14.2281 11.5069 14.3235 11.3151C14.419 11.1233 14.5145 11.0274 14.61 10.9315C14.7055 10.8356 14.801 10.7397 14.801 10.7397H14.8965C15.0874 10.6438 15.3739 10.7397 15.5649 10.9315C15.8514 11.1233 16.1378 11.411 16.3288 11.6986C16.5198 11.9863 16.8063 12.274 17.1883 12.6575C17.5702 13.0411 17.8567 13.3288 18.0477 13.4247L18.3341 13.6164C18.5251 13.7123 18.7161 13.8082 19.0026 13.9041C19.289 14 19.48 14 19.671 14L22.9177 13.9041C23.2041 13.9041 23.4906 13.8082 23.6816 13.7123C23.8726 13.6164 23.968 13.5205 23.968 13.3288C23.968 13.2329 23.968 13.0411 23.968 12.9452C23.7771 12.7534 23.7771 12.6575 23.7771 12.5616Z" fill="#224875"/>
							</svg>
						</a>
						<?php } ?>
						<?php $site_insta = get_option('site_insta');
						if (!empty($site_insta)) { ?>
						<a href="<?php echo $site_insta; ?>" target="_blank" rel="noopener noreferrer">
							<svg width="21" height="21" viewBox="0 0 21 21" fill="none" xmlns="http://www.w3.org/2000/svg">
								<path d="M18.0115 0H2.98846C1.29231 0 0 1.29231 0 2.98846V18.0115C0 19.7077 1.29231 21 2.98846 21H18.0115C19.7077 21 21 19.7077 21 18.0115V2.98846C21 1.29231 19.7077 0 18.0115 0ZM10.5 16.8C13.9731 16.8 16.8 14.0538 16.8 10.7423C16.8 10.1769 16.7192 9.53077 16.5577 9.04615H18.3346V17.6077C18.3346 18.0115 18.0115 18.4154 17.5269 18.4154H3.47308C3.06923 18.4154 2.66539 18.0923 2.66539 17.6077V8.96538H4.52308C4.36154 9.53077 4.28077 10.0962 4.28077 10.6615C4.2 14.0538 7.02692 16.8 10.5 16.8ZM10.5 14.3769C8.23846 14.3769 6.46154 12.6 6.46154 10.4192C6.46154 8.23846 8.23846 6.46154 10.5 6.46154C12.7615 6.46154 14.5385 8.23846 14.5385 10.4192C14.5385 12.6808 12.7615 14.3769 10.5 14.3769ZM18.2539 5.73461C18.2539 6.21923 17.85 6.62308 17.3654 6.62308H15.1038C14.6192 6.62308 14.2154 6.21923 14.2154 5.73461V3.55385C14.2154 3.06923 14.6192 2.66538 15.1038 2.66538H17.3654C17.85 2.66538 18.2539 3.06923 18.2539 3.55385V5.73461Z" fill="#224875"/>
							</svg>
						</a>
						<?php } ?>
						<?php $site_ok = get_option('site_ok');
						if (!empty($site_ok)) { ?>
						<a href="<?php echo $site_ok; ?>" target="_blank" rel="noopener noreferrer">
							<svg width="16" height="26" viewBox="0 0 16 26" fill="none" xmlns="http://www.w3.org/2000/svg">
								<path d="M15.4794 16C16.0929 15.3913 16.1806 14.5217 15.6547 13.6522C15.2164 12.9565 14.4275 12.6087 13.5509 12.7826C13.2003 12.8696 12.8497 13.0435 12.4991 13.3044C9.78176 15.1304 6.10025 15.0435 3.38294 13.2174C3.20763 13.1304 3.03231 13.0435 2.857 12.9565C1.8928 12.5217 0.928601 12.6957 0.40267 13.5652C-0.210916 14.4348 -0.123271 15.3913 0.665625 16.1739C0.840935 16.3478 1.01625 16.4348 1.1039 16.6087L1.19156 16.6957C2.41873 17.6522 3.90887 18.2609 5.83729 18.5217L4.69777 19.6522C3.73356 20.6087 2.6817 21.6522 1.7175 22.6087C1.45453 22.8696 1.1039 23.3044 1.1039 23.913C1.1039 24.6957 1.54218 25.4783 2.33108 25.8261C2.59405 26 2.85701 26 3.11997 26C3.55825 26 4.08418 25.8261 4.4348 25.3913C5.74963 24.087 6.8015 23.0435 7.85336 22C7.94101 21.9131 7.94101 21.913 7.94101 21.913C7.94101 21.913 8.02867 21.9131 8.02867 22C8.72991 22.7826 9.5188 23.4783 10.22 24.2609C10.5707 24.6087 10.9213 24.9565 11.2719 25.3044C11.7102 25.7391 12.0608 25.9131 12.5867 25.9131C13.3756 26 14.2522 25.4783 14.6028 24.6957C14.9534 24 14.7781 23.1304 14.1645 22.6087C13.288 21.7391 12.4114 20.7826 11.4472 19.913L9.95708 18.4348C10.746 18.3478 11.6225 18.1739 12.4114 17.8261C13.7263 17.3913 14.6905 16.7826 15.4794 16Z" fill="#224875"/>
								<path d="M7.94101 13.5652C11.7102 13.5652 14.7781 10.6087 14.7781 6.86956C14.7781 5.04347 14.0769 3.30435 12.762 2C11.4472 0.695655 9.78177 0 8.02867 0C4.25949 0 1.27922 3.04347 1.19156 6.69565C1.19156 8.52173 1.8928 10.1739 3.20763 11.4783C4.4348 12.8696 6.10025 13.5652 7.94101 13.5652ZM6.01259 4.86957C6.53853 4.34783 7.23976 4.08695 7.94101 4.08695C9.5188 4.08695 10.6583 5.30435 10.6583 6.78261C10.6583 8.34783 9.43114 9.47825 7.94101 9.47825C6.36321 9.47825 5.2237 8.26087 5.2237 6.78261C5.2237 6.08696 5.48666 5.39131 6.01259 4.86957Z" fill="#224875"/>
								<path d="M15.4794 16C16.0929 15.3913 16.1806 14.5217 15.6547 13.6522C15.2164 12.9565 14.4275 12.6087 13.5509 12.7826C13.2003 12.8696 12.8497 13.0435 12.4991 13.3044C9.78176 15.1304 6.10025 15.0435 3.38294 13.2174C3.20763 13.1304 3.03231 13.0435 2.857 12.9565C1.8928 12.5217 0.928601 12.6957 0.40267 13.5652C-0.210916 14.4348 -0.123271 15.3913 0.665625 16.1739C0.840935 16.3478 1.01625 16.4348 1.1039 16.6087L1.19156 16.6957C2.41873 17.6522 3.90887 18.2609 5.83729 18.5217L4.69777 19.6522C3.73356 20.6087 2.6817 21.6522 1.7175 22.6087C1.45453 22.8696 1.1039 23.3044 1.1039 23.913C1.1039 24.6957 1.54218 25.4783 2.33108 25.8261C2.59405 26 2.85701 26 3.11997 26C3.55825 26 4.08418 25.8261 4.4348 25.3913C5.74963 24.087 6.8015 23.0435 7.85336 22C7.94101 21.9131 7.94101 21.913 7.94101 21.913C7.94101 21.913 8.02867 21.9131 8.02867 22C8.72991 22.7826 9.5188 23.4783 10.22 24.2609C10.5707 24.6087 10.9213 24.9565 11.2719 25.3044C11.7102 25.7391 12.0608 25.9131 12.5867 25.9131C13.3756 26 14.2522 25.4783 14.6028 24.6957C14.9534 24 14.7781 23.1304 14.1645 22.6087C13.288 21.7391 12.4114 20.7826 11.4472 19.913L9.95708 18.4348C10.746 18.3478 11.6225 18.1739 12.4114 17.8261C13.7263 17.3913 14.6905 16.7826 15.4794 16Z" fill="#224875"/>
							</svg>                        
						</a>
						<?php } ?>
					</div>
				</div>
			</div>
		</div>
	</div>
<?php endif ?> 
<?php get_footer(); ?>